rishabt/microprocessor-systems/Lab4_STM32F4Cube_Base_project/Sources/main.c
/*******************************************************************************
  * @file    main.c
  * @author  Ashraf Suyyagh
	* @version V1.2.0
  * @date    17-January-2016
  * @brief   This file demonstrates flasing one LED at an interval of one second
	*          RTX based using CMSIS-RTOS 
  ******************************************************************************
  */

#include "stm32f4xx_hal.h"              // Keil::Device:STM32Cube HAL:Common
#include "cmsis_os.h"                   // ARM::CMSIS:RTOS:Keil RTX
#include "RTE_Components.h"             // Component selection
#include "thread.h"
#include "config.h"
#include "math.h"
#include "supporting_functions.h"
#include "lis3dsh.h"
#include "accelerometer_interface.h"
#include "temperature_interface.h"
#include "seven_segment.h"
#include "utils.h"

int DISPLAY_ACC = 1;
int DISPLAY_TEMP = 0;

int ACC_PITCH = 1;
int ACC_ROLL = 0;

extern void initializeLED_IO			(void);
extern void start_Thread_LED			(void);
extern void Thread_LED(void const *argument);
extern osThreadId tid_Thread_LED;
extern double tmp_pitch;
extern int DISPLAY_OPTION;

extern int pitch;
extern ADC_HandleTypeDef ADC1_Handle;
float temp;

int digit = 4;

float readings[3];

char down = 'D';
char up = 'U';

int display_flag, in_range;
double upper_bound, lower_bound;

osSemaphoreId accelerometer_select;
osSemaphoreDef(accelerometer_select);

osSemaphoreId temperature_select;
osSemaphoreDef(temperature_select);


/**
	These lines are mandatory to make CMSIS-RTOS RTX work with te new Cube HAL
*/
#ifdef RTE_CMSIS_RTOS_RTX
extern uint32_t os_time;

uint32_t HAL_GetTick(void) { 
  return os_time; 
}
#endif

/**
  * System Clock Configuration
  */
void SystemClock_Config(void) {
  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

  /* Enable Power Control clock */
  __HAL_RCC_PWR_CLK_ENABLE();

  /* The voltage scaling allows optimizing the power consumption when the
     device is clocked below the maximum system frequency (see datasheet). */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  /* Enable HSE Oscillator and activate PLL with HSE as source */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 8;
  RCC_OscInitStruct.PLL.PLLN = 336;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  HAL_RCC_OscConfig(&RCC_OscInitStruct);

  /* Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2
     clocks dividers */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1 |
                                RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;
  HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5);
}

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  /* Prevent unused argument(s) compilation warning */
  __IO uint32_t tmpreg = 0x00;
  UNUSED(tmpreg); 

	if (GPIO_Pin == GPIO_PIN_0){
		
		LIS3DSH_ReadACC(readings);
		
		HAL_NVIC_ClearPendingIRQ(EXTI0_IRQn);
		osSemaphoreRelease(accelerometer_select);
		
	}
	
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef* htim)
{
	if(htim->Instance == TIM2)
	{
		temp = HAL_ADC_GetValue(&ADC1_Handle);
		
		osSemaphoreRelease(temperature_select);
	}	
	
	if(htim->Instance == TIM3)
	{
		display_flag++;
		
		if(DISPLAY_ACC == 1)
		{
				digit = digit - 1;
				
				if(digit == 0)
				{
					digit = 4;
				}
				
				display(tmp_pitch);			
		}
		
	}
}

/**
  * Main function
  */
int main (void) {

  osKernelInitialize();                     /* initialize CMSIS-RTOS          */

  HAL_Init();                               /* Initialize the HAL Library     */

  SystemClock_Config();                     /* Configure the System Clock     */

	config_all();
	
	initializeLED_IO();                       /* Initialize LED GPIO Buttons    */
  start_Thread_LED();                       /* Create LED thread              */
	
	/**************** Accelerometer thread setup *********************************/
	acc_kalmanState_Config();
	
	accelerometer_select = osSemaphoreCreate(osSemaphore(accelerometer_select), 1);
	accelerometer_set_semaphore(accelerometer_select);
	
	start_Thread_Accelerometer();                       /* Create LED thread              */
	
	/************** Temperature Sensor Thread Setup *****************************/
	temp_kalmanState_Config();
	
	temperature_select = osSemaphoreCreate(osSemaphore(temperature_select), 1);
	temperature_set_semaphore(temperature_select);
	
	start_Thread_Temperature_Sensor();                       /* Create LED thread              */
	
	/* User codes ends here*/
  
	osKernelStart();                          /* start thread execution         */
}
